app/views/users/index.html.erb

      <tr >
        <td><%= time_ago_in_words(user.created_at) %></td>
---
INSERT INTO "users" ("username", "name", "email", "password", "created_at", "updated_at") VALUES ('babulalsir1', 'babulal sir', 'babulalsir1@gmail.com', 'Babulal@12', '2025-10-07 09:00:34.444924', '2025-10-07 09:00:34.444924') RETURNING "id"