app/controllers/users_controller.rb

  def index
    # byebug
    @users = User.all
---
SELECT "users".* FROM "users"

  def create

    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "name", "email", "password", "created_at", "updated_at") VALUES ('Ashutosh1', 'ashutosh', 'ashu1@gmail.com', 'Ash@1', '2025-10-08 12:17:14.104781', '2025-10-08 12:17:14.104781') RETURNING "id"

  def show
    # id = params.extract_value(:id)
    # @user = User.find(id)

    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def edit
    #only for get request
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

  def update
    #put and patch request is going to execute here
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
UPDATE "users" SET "username" = 'edited', "name" = 'edit', "email" = 'edit1@gmail.com', "password" = 'Edit@12', "updated_at" = '2025-10-08 12:19:31.384186' WHERE "users"."id" = 6